app/controllers/answers_controller.rb

INSERT INTO "answers" ("created_at", "description", "question_id", "updated_at") VALUES (?, ?, ?, ?)
---
  def create
    # binding.pry
    @answer = Answer.new(question_id: params["question_id"], description: params["answer"][:description])
    if @answer.save