app/controllers/questions_controller.rb

SELECT "questions".* FROM "questions"   ORDER BY "questions"."created_at" DESC
---
  def index
    @questions = Question.order(created_at: :desc)

INSERT INTO "questions" ("created_at", "description", "title", "updated_at") VALUES (?, ?, ?, ?)
---
  def create
    @question = Question.new(question_params)
    if @question.save

SELECT  "questions".* FROM "questions"  WHERE "questions"."id" = ? LIMIT 1  [["id", 3]]
UPDATE "questions" SET "description" = ?, "title" = ?, "updated_at" = ? WHERE "questions"."id" = 8  [["description", "uyrkcytluytluytliutluys,dfhz/kgh/kghs/"], ["title", "new question EDIT EDIT EDIT"], ["updated_at", "2014-12-17 02:56:10.740645"]]
---
  def update
    @question = Question.find(params[:id])
    if @question.update(question_params)